posts/esp8266_ubuntu.html
<!DOCTYPE html><html><head><!-- 2023-05-17 --><meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ESP8266 in ubuntu</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content">
<div id="outline-container-org8d2c7d5" class="outline-2">
<h2 id="org8d2c7d5">Intro</h2>
<div class="outline-text-2" id="text-org8d2c7d5">
<p>
I want to explore in the side of IOT devices for very long time, Arduino
or Raspberry Pi. Let's go shopping but where ???
</p>

<p>
<b>Ritchie Street</b> of course, It is the second-largest electronic market
in India. Managed to grab ESP8266, Breadboard and Jumper wire.
</p>

<p>
Okay let's try to run a simple script in ESP8266 in Ubuntu.
</p>
</div>
</div>

<div id="outline-container-org0c4cb75" class="outline-2">
<h2 id="org0c4cb75">Booting ESP8266</h2>
<div class="outline-text-2" id="text-org0c4cb75">
<ul class="org-ul">
<li>I tried booting the esp8266 in Ubuntu 22.04, using a micro USB cable.</li>
<li>Use the below command to check if any new device is connected.</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">lsusb
</pre>
</div>

<ul class="org-ul">
<li>Check the output differs after and before the connecting device if you
see any new device then it is detected.</li>
<li>Device is not shown for me for the first time</li>
<li>After surfing the web, Probably it is the cable fault (cable must
support data transfer otherwise it won't work).</li>
<li>I ordered a new Amazon micro USB data cable, The device is shown after
using this cable using above command</li>
</ul>

<pre class="example" id="org35a8ba6">
Bus 003 Device 005: ID 1a86:7523 QinHeng Electronics CH340 serial converter
</pre>

<ul class="org-ul">
<li>Check all the TTY devices and check if you found any file starts like
<code>/dev/ttyUSB</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">ls /dev/tty*
</pre>
</div>

<ul class="org-ul">
<li>Or you can use the below command</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">ls /dev/ttyUSB*
</pre>
</div>

<ul class="org-ul">
<li><code>Arduino IDE</code> doesn't detect the device</li>
<li>DAMN, what's the problem now ???</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">sudo dmesg --follow
</pre>
</div>

<ul class="org-ul">
<li>I saw some device like this</li>
</ul>

<pre class="example" id="orge1ed9ed">
[   60.830127] usb 1-2: usbfs: interface 0 claimed by ch341 while 'brltty' sets config #1
</pre>

<ul class="org-ul">
<li>After checking the Ubuntu fourms, I figured we need to remove the
above driver <b>brltty</b>, because the device is detected wrongly</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">sudo apt remove brltty
</pre>
</div>

<ul class="org-ul">
<li>Now Arduino IDE able to detect the device let's try the Hello world of
Electronics (Blinking the LED)</li>
<li>let's try to blink the LED 2 that comes with ESP8266</li>
</ul>

<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#define</span> <span class="org-variable-name">ledPin1</span> 2

<span class="org-type">void</span> <span class="org-function-name">setup</span>() {
  <span class="org-comment-delimiter">// </span><span class="org-comment">put your setup code here, to run once:</span>
  pinMode(ledPin1, OUTPUT);
}

<span class="org-type">void</span> <span class="org-function-name">loop</span>() {
  digitalWrite(ledPin1, LOW);
  delay(1000);
  digitalWrite(ledPin1, HIGH);
  delay(1000);
}
</pre>
</div>

<ul class="org-ul">
<li>Failed to upload to the device, with following problem.</li>
</ul>

<pre class="example" id="org9198871">
arduino Minimal supported version of Python is 3.7
</pre>

<ul class="org-ul">
<li>So basically it can't find the python executable</li>
<li>I installed the Arduino from Ubuntu App store</li>
<li>Arduino provide <code>appImage</code> executable for the Linux distro so let's
try it then.</li>
<li>I fired it up and try to upload the code it worked like charm.</li>
</ul>

<p>
Finally we are able to make the device works, hope this will help others
in running code in ESP 8266 from Ubuntu
</p>
</div>
</div>

<div id="outline-container-org015d521" class="outline-2">
<h2 id="org015d521">Reference</h2>
<div class="outline-text-2" id="text-org015d521">
<ul class="org-ul">
<li><a href="https://askubuntu.com/questions/1403705/dev-ttyusb0-not-present-in-ubuntu-22-04">https://askubuntu.com/questions/1403705/dev-ttyusb0-not-present-in-ubuntu-22-04</a></li>
<li><a href="https://unix.stackexchange.com/questions/670636/unable-to-use-usb-dongle-based-on-usb-serial-converter-chip">https://unix.stackexchange.com/questions/670636/unable-to-use-usb-dongle-based-on-usb-serial-converter-chip</a></li>
</ul>
</div>
</div>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
